Revit 2024 API
ReleaseConditions Constructor (Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Creates a new instance of ReleaseConditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ReleaseConditions(
	bool start,
	bool fx,
	bool fy,
	bool fz,
	bool mx,
	bool my,
	bool mz
)
Visual Basic
Public Sub New ( _
	start As Boolean, _
	fx As Boolean, _
	fy As Boolean, _
	fz As Boolean, _
	mx As Boolean, _
	my As Boolean, _
	mz As Boolean _
)
Visual C++
public:
ReleaseConditions(
	bool start,
	bool fx,
	bool fy,
	bool fz,
	bool mx,
	bool my,
	bool mz
)
Parameters
start
Type: System.Boolean
 The position on analytical element. True for start, false for end.
fx
Type: System.Boolean
 Fx of the release type.
fy
Type: System.Boolean
 Fy of the release type.
fz
Type: System.Boolean
 Fz of the release type.
mx
Type: System.Boolean
 Mx of the release type.
my
Type: System.Boolean
 My of the release type.
mz
Type: System.Boolean
See Also
ReleaseConditions Class
ReleaseConditions Overload
Autodesk.Revit.DB.Structure Namespace